jmeter.log
2025-12-03 20:46:22,547 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-12-03 20:46:22,565 INFO o.a.j.JMeter: Loading user properties from: C:\Users\Asus\Documents\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\user.properties
2025-12-03 20:46:22,565 INFO o.a.j.JMeter: Loading system properties from: C:\Users\Asus\Documents\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\system.properties
2025-12-03 20:46:22,572 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-12-03 20:46:22,572 INFO o.a.j.JMeter: Version 5.6.3
2025-12-03 20:46:22,572 INFO o.a.j.JMeter: java.version=25.0.1
2025-12-03 20:46:22,572 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-12-03 20:46:22,572 INFO o.a.j.JMeter: os.name=Windows 11
2025-12-03 20:46:22,572 INFO o.a.j.JMeter: os.arch=amd64
2025-12-03 20:46:22,573 INFO o.a.j.JMeter: os.version=10.0
2025-12-03 20:46:22,573 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-12-03 20:46:22,573 INFO o.a.j.JMeter: java.awt.headless=true
2025-12-03 20:46:22,573 INFO o.a.j.JMeter: Max memory     =1073741824
2025-12-03 20:46:22,573 INFO o.a.j.JMeter: Available Processors =16
2025-12-03 20:46:22,585 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-12-03 20:46:22,586 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-12-03 20:46:22,586 INFO o.a.j.JMeter: JMeterHome=C:\Users\Asus\Documents\apache-jmeter-5.6.3\apache-jmeter-5.6.3
2025-12-03 20:46:22,586 INFO o.a.j.JMeter: user.dir  =C:\xampp\htdocs\BanDienThoai-main
2025-12-03 20:46:22,586 INFO o.a.j.JMeter: PWD       =C:\xampp\htdocs\BanDienThoai-main
2025-12-03 20:46:27,567 INFO o.a.j.JMeter: IP: 26.166.153.168 Name: LAPTOP-KM2HSHKQ FullName: LAPTOP-KM2HSHKQ
2025-12-03 20:46:27,577 INFO o.a.j.s.FileServer: Default base='C:\xampp\htdocs\BanDienThoai-main'
2025-12-03 20:46:27,578 INFO o.a.j.s.FileServer: Set new base='C:\xampp\htdocs\BanDienThoai-main'
2025-12-03 20:46:27,763 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-12-03 20:46:27,779 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-12-03 20:46:27,783 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-12-03 20:46:27,785 INFO o.a.j.s.SaveService: Loading file: load_test_home.jmx
2025-12-03 20:46:27,822 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-03 20:46:27,822 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-03 20:46:27,822 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-03 20:46:27,822 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-03 20:46:27,823 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-12-03 20:46:27,823 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-12-03 20:46:27,839 INFO o.a.j.JMeter: Creating summariser <summary>
2025-12-03 20:46:27,849 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-12-03 20:46:27,850 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-03 20:46:27,850 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-03 20:46:27,855 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-12-03 20:46:27,855 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-12-03 20:46:27,926 INFO o.a.j.JMeter: Running test (1764769587926)
2025-12-03 20:46:27,944 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2025-12-03 20:46:27,944 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group Thread Group.
2025-12-03 20:46:27,944 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-12-03 20:46:27,944 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=50 ramp-up=10 delayedStart=false
2025-12-03 20:46:27,951 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2025-12-03 20:46:27,959 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-12-03 20:46:27,959 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-12-03 20:46:27,965 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = LAPTOP-KM2HSHKQ
2025-12-03 20:46:27,970 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-12-03 20:46:27,971 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-12-03 20:46:27,971 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-12-03 20:46:27,971 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-12-03 20:46:27,971 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-12-03 20:46:28,078 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2025-12-03 20:46:28,078 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2025-12-03 20:46:28,147 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-2
2025-12-03 20:46:28,177 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-2
2025-12-03 20:46:28,177 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-2
2025-12-03 20:46:28,347 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-3
2025-12-03 20:46:28,380 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-3
2025-12-03 20:46:28,380 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-3
2025-12-03 20:46:28,547 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-4
2025-12-03 20:46:28,566 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-4
2025-12-03 20:46:28,567 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-4
2025-12-03 20:46:28,746 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-5
2025-12-03 20:46:28,769 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-5
2025-12-03 20:46:28,769 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-5
2025-12-03 20:46:28,947 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-6
2025-12-03 20:46:28,969 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-6
2025-12-03 20:46:28,969 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-6
2025-12-03 20:46:29,145 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-7
2025-12-03 20:46:29,169 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-7
2025-12-03 20:46:29,169 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-7
2025-12-03 20:46:29,346 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-8
2025-12-03 20:46:29,371 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-8
2025-12-03 20:46:29,371 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-8
2025-12-03 20:46:29,546 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-9
2025-12-03 20:46:29,570 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-9
2025-12-03 20:46:29,570 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-9
2025-12-03 20:46:29,745 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-10
2025-12-03 20:46:29,773 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-10
2025-12-03 20:46:29,773 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-10
2025-12-03 20:46:29,946 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-11
2025-12-03 20:46:29,977 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-11
2025-12-03 20:46:29,977 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-11
2025-12-03 20:46:30,145 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-12
2025-12-03 20:46:30,179 INFO o.a.j.r.Summariser: summary +     12 in 00:00:02 =    5.3/s Avg:    27 Min:    18 Max:    55 Err:     0 (0.00%) Active: 1 Started: 12 Finished: 11
2025-12-03 20:46:30,180 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-12
2025-12-03 20:46:30,180 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-12
2025-12-03 20:46:30,345 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-13
2025-12-03 20:46:30,364 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-13
2025-12-03 20:46:30,364 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-13
2025-12-03 20:46:30,545 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-14
2025-12-03 20:46:30,566 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-14
2025-12-03 20:46:30,566 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-14
2025-12-03 20:46:30,744 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-15
2025-12-03 20:46:30,766 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-15
2025-12-03 20:46:30,766 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-15
2025-12-03 20:46:30,944 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-16
2025-12-03 20:46:30,967 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-16
2025-12-03 20:46:30,967 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-16
2025-12-03 20:46:31,146 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-17
2025-12-03 20:46:31,172 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-17
2025-12-03 20:46:31,173 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-17
2025-12-03 20:46:31,347 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-18
2025-12-03 20:46:31,374 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-18
2025-12-03 20:46:31,374 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-18
2025-12-03 20:46:31,545 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-19
2025-12-03 20:46:31,576 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-19
2025-12-03 20:46:31,576 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-19
2025-12-03 20:46:31,745 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-20
2025-12-03 20:46:31,764 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-20
2025-12-03 20:46:31,764 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-20
2025-12-03 20:46:31,945 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-21
2025-12-03 20:46:31,966 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-21
2025-12-03 20:46:31,966 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-21
2025-12-03 20:46:32,145 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-22
2025-12-03 20:46:32,168 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-22
2025-12-03 20:46:32,168 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-22
2025-12-03 20:46:32,345 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-23
2025-12-03 20:46:32,368 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-23
2025-12-03 20:46:32,368 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-23
2025-12-03 20:46:32,545 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-24
2025-12-03 20:46:32,571 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-24
2025-12-03 20:46:32,571 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-24
2025-12-03 20:46:32,744 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-25
2025-12-03 20:46:32,775 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-25
2025-12-03 20:46:32,775 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-25
2025-12-03 20:46:32,945 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-26
2025-12-03 20:46:32,978 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-26
2025-12-03 20:46:32,978 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-26
2025-12-03 20:46:33,144 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-27
2025-12-03 20:46:33,166 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-27
2025-12-03 20:46:33,166 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-27
2025-12-03 20:46:33,344 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-28
2025-12-03 20:46:33,369 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-28
2025-12-03 20:46:33,369 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-28
2025-12-03 20:46:33,544 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-29
2025-12-03 20:46:33,570 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-29
2025-12-03 20:46:33,570 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-29
2025-12-03 20:46:33,745 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-30
2025-12-03 20:46:33,773 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-30
2025-12-03 20:46:33,774 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-30
2025-12-03 20:46:33,945 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-31
2025-12-03 20:46:33,976 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-31
2025-12-03 20:46:33,976 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-31
2025-12-03 20:46:34,146 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-32
2025-12-03 20:46:34,165 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-32
2025-12-03 20:46:34,165 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-32
2025-12-03 20:46:34,345 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-33
2025-12-03 20:46:34,368 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-33
2025-12-03 20:46:34,368 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-33
2025-12-03 20:46:34,544 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-34
2025-12-03 20:46:34,570 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-34
2025-12-03 20:46:34,570 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-34
2025-12-03 20:46:34,745 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-35
2025-12-03 20:46:34,773 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-35
2025-12-03 20:46:34,773 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-35
2025-12-03 20:46:34,946 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-36
2025-12-03 20:46:34,975 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-36
2025-12-03 20:46:34,976 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-36
2025-12-03 20:46:35,146 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-37
2025-12-03 20:46:35,163 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-37
2025-12-03 20:46:35,163 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-37
2025-12-03 20:46:35,345 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-38
2025-12-03 20:46:35,366 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-38
2025-12-03 20:46:35,366 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-38
2025-12-03 20:46:35,544 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-39
2025-12-03 20:46:35,570 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-39
2025-12-03 20:46:35,570 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-39
2025-12-03 20:46:35,746 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-40
2025-12-03 20:46:35,770 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-40
2025-12-03 20:46:35,771 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-40
2025-12-03 20:46:35,946 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-41
2025-12-03 20:46:35,973 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-41
2025-12-03 20:46:35,974 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-41
2025-12-03 20:46:36,147 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-42
2025-12-03 20:46:36,173 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-42
2025-12-03 20:46:36,174 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-42
2025-12-03 20:46:36,345 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-43
2025-12-03 20:46:36,374 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-43
2025-12-03 20:46:36,374 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-43
2025-12-03 20:46:36,544 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-44
2025-12-03 20:46:36,562 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-44
2025-12-03 20:46:36,562 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-44
2025-12-03 20:46:36,745 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-45
2025-12-03 20:46:36,763 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-45
2025-12-03 20:46:36,763 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-45
2025-12-03 20:46:36,945 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-46
2025-12-03 20:46:36,965 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-46
2025-12-03 20:46:36,965 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-46
2025-12-03 20:46:37,145 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-47
2025-12-03 20:46:37,167 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-47
2025-12-03 20:46:37,167 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-47
2025-12-03 20:46:37,345 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-48
2025-12-03 20:46:37,369 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-48
2025-12-03 20:46:37,369 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-48
2025-12-03 20:46:37,545 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-49
2025-12-03 20:46:37,573 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-49
2025-12-03 20:46:37,573 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-49
2025-12-03 20:46:37,745 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-50
2025-12-03 20:46:37,776 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-50
2025-12-03 20:46:37,776 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-50
2025-12-03 20:46:37,776 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-12-03 20:46:37,777 INFO o.a.j.r.Summariser: summary +     38 in 00:00:08 =    5.0/s Avg:    23 Min:    15 Max:    31 Err:     0 (0.00%) Active: 0 Started: 50 Finished: 50
2025-12-03 20:46:37,777 INFO o.a.j.r.Summariser: summary =     50 in 00:00:10 =    5.1/s Avg:    24 Min:    15 Max:    55 Err:     0 (0.00%)